experiment-data/MicroShift/dp_redis_density-3/dp_redis_density/2022-10-11T11-24-44/kbench-pod-oid-0-tid-0/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1604.34          ---          ---        11.31118         6.04700        86.01500       185.34300       123.59 
Gets        16041.70         3.33     16038.37        11.31436         6.04700        86.01500       187.39100       624.98 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      17646.04         3.33     16038.37        11.31407         6.04700        86.01500       187.39100       748.57 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.167        0.000
SET       1.231        5.000
SET       1.575       10.000
SET       1.983       15.000
SET       2.607       20.000
SET       3.151       25.000
SET       3.679       30.000
SET       4.223       35.000
SET       4.799       40.000
SET       5.375       45.000
SET       6.047       50.000
SET       6.399       52.500
SET       6.783       55.000
SET       7.231       57.500
SET       7.711       60.000
SET       8.255       62.500
SET       8.959       65.000
SET       9.663       67.500
SET      10.559       70.000
SET      11.519       72.500
SET      12.671       75.000
SET      13.311       76.250
SET      13.951       77.500
SET      14.719       78.750
SET      15.423       80.000
SET      16.255       81.250
SET      17.151       82.500
SET      18.047       83.750
SET      19.199       85.000
SET      20.351       86.250
SET      21.631       87.500
SET      22.399       88.125
SET      23.167       88.750
SET      24.063       89.375
SET      24.959       90.000
SET      26.111       90.625
SET      27.135       91.250
SET      28.415       91.875
SET      29.951       92.500
SET      31.487       93.125
SET      33.279       93.750
SET      34.303       94.062
SET      35.327       94.375
SET      36.607       94.688
SET      37.631       95.000
SET      39.167       95.312
SET      40.447       95.625
SET      42.239       95.938
SET      43.775       96.250
SET      46.079       96.562
SET      48.639       96.875
SET      49.663       97.031
SET      51.199       97.188
SET      52.991       97.344
SET      55.039       97.500
SET      57.087       97.656
SET      59.391       97.812
SET      61.695       97.969
SET      64.255       98.125
SET      67.071       98.281
SET      70.143       98.438
SET      71.679       98.516
SET      73.727       98.594
SET      75.263       98.672
SET      77.311       98.750
SET      79.871       98.828
SET      82.431       98.906
SET      85.503       98.984
SET      88.575       99.062
SET      91.647       99.141
SET      95.743       99.219
SET      97.791       99.258
SET      99.839       99.297
SET     101.887       99.336
SET     103.935       99.375
SET     106.495       99.414
SET     109.567       99.453
SET     112.639       99.492
SET     116.223       99.531
SET     120.319       99.570
SET     123.903       99.609
SET     125.951       99.629
SET     128.511       99.648
SET     132.095       99.668
SET     134.143       99.688
SET     137.215       99.707
SET     140.287       99.727
SET     143.359       99.746
SET     146.431       99.766
SET     150.527       99.785
SET     154.623       99.805
SET     157.695       99.814
SET     159.743       99.824
SET     161.791       99.834
SET     163.839       99.844
SET     166.911       99.854
SET     169.983       99.863
SET     173.055       99.873
SET     177.151       99.883
SET     181.247       99.893
SET     186.367       99.902
SET     188.415       99.907
SET     190.463       99.912
SET     193.535       99.917
SET     195.583       99.922
SET     197.631       99.927
SET     200.703       99.932
SET     202.751       99.937
SET     206.847       99.941
SET     210.943       99.946
SET     216.063       99.951
SET     218.111       99.954
SET     220.159       99.956
SET     224.255       99.958
SET     227.327       99.961
SET     232.447       99.963
SET     234.495       99.966
SET     243.711       99.968
SET     248.831       99.971
SET     253.951       99.973
SET     258.047       99.976
SET     260.095       99.977
SET     264.191       99.978
SET     268.287       99.979
SET     270.335       99.980
SET     274.431       99.982
SET     278.527       99.983
SET     280.575       99.984
SET     282.623       99.985
SET     288.767       99.987
SET     294.911       99.988
SET     296.959       99.988
SET     299.007       99.989
SET     305.151       99.990
SET     313.343       99.990
SET     315.391       99.991
SET     323.583       99.991
SET     331.775       99.992
SET     335.871       99.993
SET     335.871       99.993
SET     346.111       99.994
SET     348.159       99.994
SET     350.207       99.995
SET     354.303       99.995
SET     354.303       99.995
SET     356.351       99.995
SET     356.351       99.996
SET     356.351       99.996
SET     358.399       99.996
SET     360.447       99.997
SET     370.687       99.997
SET     370.687       99.997
SET     372.735       99.997
SET     374.783       99.997
SET     376.831       99.998
SET     395.263       99.998
SET     405.503       99.998
SET     421.887       99.998
SET     428.031       99.998
SET     430.079       99.998
SET     442.367       99.998
SET     485.375       99.999
SET     485.375       99.999
SET     485.375       99.999
SET     487.423       99.999
SET     487.423       99.999
SET     499.711       99.999
SET     505.855       99.999
SET     505.855       99.999
SET     505.855       99.999
SET     509.951       99.999
SET     511.999       99.999
SET     511.999       99.999
SET     511.999       99.999
SET     516.095       99.999
SET     516.095       99.999
SET     516.095       99.999
SET     516.095      100.000
SET     516.095      100.000
SET     516.095      100.000
[...]
SET     522.239      100.000
SET     522.239      100.000
SET     522.239      100.000
[...]
SET     540.671      100.000
SET     540.671      100.000
SET     540.671      100.000
[...]
SET     569.343      100.000
SET     569.343      100.000
---
GET       0.151        0.000
GET       1.231        5.000
GET       1.575       10.000
GET       1.975       15.000
GET       2.607       20.000
GET       3.151       25.000
GET       3.663       30.000
GET       4.223       35.000
GET       4.799       40.000
GET       5.375       45.000
GET       6.047       50.000
GET       6.399       52.500
GET       6.783       55.000
GET       7.231       57.500
GET       7.711       60.000
GET       8.255       62.500
GET       8.959       65.000
GET       9.663       67.500
GET      10.495       70.000
GET      11.519       72.500
GET      12.607       75.000
GET      13.247       76.250
GET      13.951       77.500
GET      14.655       78.750
GET      15.423       80.000
GET      16.191       81.250
GET      17.151       82.500
GET      18.047       83.750
GET      19.071       85.000
GET      20.351       86.250
GET      21.631       87.500
GET      22.271       88.125
GET      23.167       88.750
GET      23.935       89.375
GET      24.959       90.000
GET      25.983       90.625
GET      27.135       91.250
GET      28.415       91.875
GET      29.951       92.500
GET      31.487       93.125
GET      33.279       93.750
GET      34.303       94.062
GET      35.327       94.375
GET      36.607       94.688
GET      37.631       95.000
GET      39.167       95.312
GET      40.447       95.625
GET      42.239       95.938
GET      44.031       96.250
GET      46.079       96.562
GET      48.639       96.875
GET      49.919       97.031
GET      51.199       97.188
GET      52.991       97.344
GET      54.783       97.500
GET      56.831       97.656
GET      59.135       97.812
GET      61.695       97.969
GET      64.255       98.125
GET      67.071       98.281
GET      70.143       98.438
GET      71.679       98.516
GET      73.727       98.594
GET      75.775       98.672
GET      77.823       98.750
GET      79.871       98.828
GET      82.943       98.906
GET      85.503       98.984
GET      88.575       99.062
GET      92.159       99.141
GET      95.743       99.219
GET      98.303       99.258
GET      99.839       99.297
GET     102.399       99.336
GET     104.447       99.375
GET     107.007       99.414
GET     110.079       99.453
GET     113.151       99.492
GET     117.247       99.531
GET     120.831       99.570
GET     124.415       99.609
GET     126.975       99.629
GET     129.023       99.648
GET     132.095       99.668
GET     135.167       99.688
GET     138.239       99.707
GET     141.311       99.727
GET     144.383       99.746
GET     148.479       99.766
GET     152.575       99.785
GET     156.671       99.805
GET     158.719       99.814
GET     160.767       99.824
GET     162.815       99.834
GET     165.887       99.844
GET     168.959       99.854
GET     172.031       99.863
GET     175.103       99.873
GET     179.199       99.883
GET     184.319       99.893
GET     188.415       99.902
GET     191.487       99.907
GET     193.535       99.912
GET     196.607       99.917
GET     198.655       99.922
GET     201.727       99.927
GET     204.799       99.932
GET     208.895       99.937
GET     212.991       99.941
GET     217.087       99.946
GET     222.207       99.951
GET     225.279       99.954
GET     228.351       99.956
GET     231.423       99.958
GET     234.495       99.961
GET     241.663       99.963
GET     246.783       99.966
GET     250.879       99.968
GET     253.951       99.971
GET     257.023       99.973
GET     262.143       99.976
GET     264.191       99.977
GET     266.239       99.978
GET     270.335       99.979
GET     272.383       99.980
GET     276.479       99.982
GET     278.527       99.983
GET     282.623       99.984
GET     286.719       99.985
GET     292.863       99.987
GET     296.959       99.988
GET     299.007       99.988
GET     305.151       99.989
GET     311.295       99.990
GET     315.391       99.990
GET     319.487       99.991
GET     327.679       99.991
GET     331.775       99.992
GET     335.871       99.993
GET     339.967       99.993
GET     348.159       99.994
GET     350.207       99.994
GET     354.303       99.995
GET     356.351       99.995
GET     356.351       99.995
GET     356.351       99.995
GET     358.399       99.996
GET     360.447       99.996
GET     370.687       99.996
GET     374.783       99.997
GET     376.831       99.997
GET     380.927       99.997
GET     391.167       99.997
GET     397.311       99.997
GET     403.455       99.998
GET     407.551       99.998
GET     423.935       99.998
GET     428.031       99.998
GET     430.079       99.998
GET     434.175       99.998
GET     442.367       99.998
GET     444.415       99.999
GET     446.463       99.999
GET     466.943       99.999
GET     468.991       99.999
GET     479.231       99.999
GET     483.327       99.999
GET     495.615       99.999
GET     501.759       99.999
GET     511.999       99.999
GET     514.047       99.999
GET     514.047       99.999
GET     516.095       99.999
GET     516.095       99.999
GET     518.143       99.999
GET     518.143       99.999
GET     518.143       99.999
GET     518.143      100.000
GET     518.143      100.000
GET     520.191      100.000
GET     520.191      100.000
GET     522.239      100.000
GET     522.239      100.000
GET     522.239      100.000
GET     528.383      100.000
GET     528.383      100.000
GET     528.383      100.000
GET     540.671      100.000
GET     540.671      100.000
GET     540.671      100.000
[...]
GET     552.959      100.000
GET     552.959      100.000
GET     552.959      100.000
[...]
GET     557.055      100.000
GET     561.151      100.000
GET     561.151      100.000
GET     561.151      100.000
[...]
GET     569.343      100.000
GET     569.343      100.000
---
WAIT      0.000      100.000